&НаКлиенте
Процедура csys1_csys_ВзятьВРаботуПосле(Команда)

	Объект.csys1_Исполнитель = ПользователиКлиент.ТекущийПользователь(); 

	СсылкаСостояниеВРаботе = ПолучитьСсылкуНаСервере("В работе");	
	СсылкаСостояниеНеОбработан = ПолучитьСсылкуНаСервере("Не обработан");
	
	Если НЕ СсылкаСостояниеВРаботе = Неопределено И НЕ СсылкаСостояниеНеОбработан = Неопределено Тогда

		Если Объект.СостояниеЗаказа = СсылкаСостояниеНеОбработан Тогда
			Объект.СостояниеЗаказа = СсылкаСостояниеВРаботе;
		КонецЕсли;
	
	КонецЕсли; 	
	
    Если Модифицированность Тогда
        ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаЗакрытия", ЭтотОбъект), 
            "Данные изменены. Сохранить?", РежимДиалогаВопрос.ДаНетОтмена);
	Иначе
		ЗаписатьЗаказ();
	КонецЕсли; 	

КонецПроцедуры      

&НаКлиенте
Процедура ПослеВопросаЗакрытия(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаписатьЗаказ();
	КонецЕсли;                

КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьЗаказ() 

	ОчиститьСообщения();

	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("РежимЗаписи",	РежимЗаписиДокумента.Запись);

	Записать(ПараметрыЗаписи);
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элементы.ФормаЗаписать, "Нажатие");

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСсылкуНаСервере(СтрокаСостояния)

	СсылкаСостояния = Справочники.СостоянияЗаказовПокупателей.НайтиПоНаименованию(СтрокаСостояния);
	
	Если СсылкаСостояния = Справочники.СостоянияЗаказовПокупателей.ПустаяСсылка() Тогда
	    Сообщить("Состояние заказа: """ + СтрокаСостояния + """ не существует.");
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СсылкаСостояния;
	
КонецФункции

&НаКлиенте
Процедура csys1_csys_ВыполненоПосле(Команда)

	СсылкаСостояниеВыполнено = ПолучитьСсылкуНаСервере("Выполнен");

	Если НЕ СсылкаСостояниеВыполнено = Неопределено Тогда

			Объект.СостояниеЗаказа = СсылкаСостояниеВыполнено;
	
	КонецЕсли; 	
	
	ЗаписатьЗаказ();
	Закрыть();
КонецПроцедуры
