&НаКлиенте
Процедура Импорт(Команда)
	
	ВладелецФормы.Объект.Номенклатура.Очистить();
	
	НомерСтр = 2;

	Пока НомерСтр <= ТабличныйДокумент.ВысотаТаблицы Цикл 
		
		СтрокаТаб = ВладелецФормы.Объект.Номенклатура.Добавить();
		СтрокаТаб.Наименование 			= ТабличныйДокумент.Область("R" + Строка(НомерСтр) + "C1").Текст;
		СтрокаТаб.ИнвентарныйНомер 		= ТабличныйДокумент.Область("R" + Строка(НомерСтр) + "C2").Текст;
		СтрокаТаб.Количество 			= ТабличныйДокумент.Область("R" + Строка(НомерСтр) + "C3").Текст;
		СтрокаТаб.ГодВыпуска 			= ТабличныйДокумент.Область("R" + Строка(НомерСтр) + "C4").Текст;
		СтрокаТаб.БалансоваяСтоимость 	= ТабличныйДокумент.Область("R" + Строка(НомерСтр) + "C5").Текст;
		СтрокаТаб.РыночнаяСтоимость 	= ТабличныйДокумент.Область("R" + Строка(НомерСтр) + "C6").Текст;
		СтрокаТаб.ПроцентИзноса		 	= 100;
		НомерСтр = НомерСтр + 1; 

	КонецЦикла;
	
	Закрыть();

КонецПроцедуры
