
&ИзменениеИКонтроль("ЗаполнитьПоЗаказуПокупателя")
Процедура csys1_ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения)

	Если ЭтоВводНаОснованииЗаказНаряда(ДанныеЗаполнения) Тогда
		ВызватьИсключение НСтр("ru = 'Нельзя ввести Расходную накладную на основании заказ-наряда.'");
	КонецЕсли;

	// Основание и настройка документа.
	МассивЗаказов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("МассивЗаказовПокупателей") Тогда
		МассивЗаказов = ДанныеЗаполнения.МассивЗаказовПокупателей;
		ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти;
		ПоложениеПроекта = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти;
	Иначе
		МассивЗаказов.Добавить(ДанныеЗаполнения.Ссылка);
		ПоложениеЗаказаПокупателя = ПерсональныеНастройкиРУНФ.Прочитать(
		"ПоложениеЗаказаПокупателяВДокументахОтгрузки");
		Если Не ЗначениеЗаполнено(ПоложениеЗаказаПокупателя) Тогда
			ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
		КонецЕсли;
		Если ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке Тогда
			Заказ = ДанныеЗаполнения;
		КонецЕсли;

		ПоложениеПроекта = ПерсональныеНастройкиРУНФ.Прочитать("ПоложениеПроекта");
		Если Не ЗначениеЗаполнено(ПоложениеПроекта) Тогда
			ПоложениеПроекта = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
		КонецЕсли;
		Если ПоложениеПроекта = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке Тогда
			Проект = ДанныеЗаполнения.Проект;
		КонецЕсли;

	КонецЕсли;

	// Заполнение шапки.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателя.Ссылка КАК ОснованиеСсылка,
	|	ЗаказПокупателя.Проведен КАК ОснованиеПроведен,
	|	ЗаказПокупателя.ВидОперации КАК ВидОперации,
	|	ЗаказПокупателя.СостояниеЗаказа КАК СостояниеЗаказа,
	|	ЗаказПокупателя.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателя.БанковскийСчет = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ТОГДА ЗаказПокупателя.Организация.БанковскийСчетПоУмолчанию
	|		ИНАЧЕ ЗаказПокупателя.БанковскийСчет
	|	КОНЕЦ КАК БанковскийСчет,
	|	ЗаказПокупателя.ПоложениеСклада КАК ПоложениеСклада,
	|	ВЫБОР
	|		КОГДА РезервированиеЗапасов.Значение
	|				ИЛИ ЗаказПокупателя.УчетПотребностиПоСкладам
	|			ТОГДА ЗаказПокупателя.СтруктурнаяЕдиницаРезерв
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ЗаказПокупателя.СтруктурнаяЕдиницаПродажи КАК Подразделение,
	|	ЗаказПокупателя.Контрагент КАК Контрагент,
#Вставка
	|	ЗаказПокупателя.csys1_ПодразделениеКонтрагента КАК csys1_ПодразделениеКонтрагента,
#КонецВставки
	|	ВЫБОР
	|		КОГДА ЗаказПокупателя.КонтактноеЛицоПодписант = ЗНАЧЕНИЕ(Справочник.КонтактныеЛица.ПустаяСсылка)
	|			ТОГДА ЗаказПокупателя.Контрагент.КонтактноеЛицоПодписант
	|		ИНАЧЕ ЗаказПокупателя.КонтактноеЛицоПодписант
	|	КОНЕЦ КАК КонтактноеЛицоПодписант,
	|	ЗаказПокупателя.Договор КАК Договор,
	|	ЗаказПокупателя.ОснованиеПечатиСсылка КАК ОснованиеПечатиСсылка,
	|	ЗаказПокупателя.ОснованиеПечати КАК ОснованиеПечати,
	|	ЗаказПокупателя.ВидЦен КАК ВидЦен,
	|	ЗаказПокупателя.ВидСкидкиНаценки КАК ВидСкидкиНаценки,
	|	ЗаказПокупателя.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|	ЗаказПокупателя.ПроцентСкидкиПоДисконтнойКарте КАК ПроцентСкидкиПоДисконтнойКарте,
	|	ЗаказПокупателя.ВалютаДокумента КАК ВалютаДокумента,
	|	ЗаказПокупателя.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ЗаказПокупателя.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ЗаказПокупателя.НДСВключатьВСтоимость КАК НДСВключатьВСтоимость,
	|	ЗаказПокупателя.ОжидаетсяВыборВариантаКП КАК ОжидаетсяВыборВариантаКП,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателя.ВалютаДокумента = НациональнаяВалюта.Значение
	|			ТОГДА ЗаказПокупателя.Курс
	|		ИНАЧЕ КурсыВалютСрезПоследних.Курс
	|	КОНЕЦ КАК Курс,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателя.ВалютаДокумента = НациональнаяВалюта.Значение
	|			ТОГДА ЗаказПокупателя.Кратность
	|		ИНАЧЕ КурсыВалютСрезПоследних.Кратность
	|	КОНЕЦ КАК Кратность,
	|	ЗаказПокупателя.Вес КАК Вес,
	|	ЗаказПокупателя.Объем КАК Объем,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателя.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.Самовывоз))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		ИНАЧЕ ЗаказПокупателя.НоменклатураДоставки
	|	КОНЕЦ КАК НоменклатураДоставки,
	|	ЗаказПокупателя.СтоимостьДоставки КАК СтоимостьДоставки,
	|	ЗаказПокупателя.СтавкаНДСДоставки КАК СтавкаНДСДоставки,
	|	ЗаказПокупателя.СуммаНДСДоставки КАК СуммаНДСДоставки,
	|	ЗаказПокупателя.Договор.СпособЗачетаПредоплатыПоУмолчанию КАК СпособЗачетаПредоплаты,
	|	ЗаказПокупателя.Грузоотправитель КАК Грузоотправитель,
	|	ЗаказПокупателя.Грузополучатель КАК Грузополучатель,
	|	ЗаказПокупателя.АдресДоставки КАК АдресДоставки,
	|	ЗаказПокупателя.Проект КАК Проект,
	|	ЗаказПокупателя.УсловияСчетаЗаказа КАК УсловияСчетаЗаказа,
	|	ЗаказПокупателя.ТекстУсловийСчетаЗаказа КАК ТекстУсловийСчетаЗаказа,
	|	ЗаказПокупателя.УсловияГарантийногоТалона КАК УсловияГарантийногоТалона,
	|	ЗаказПокупателя.ТекстУсловийГарантийногоТалона КАК ТекстУсловийГарантийногоТалона,
	|	ЗаказПокупателя.СпециальныйНалоговыйРежим КАК СпециальныйНалоговыйРежим
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, ) КАК КурсыВалютСрезПоследних
	|		ПО ЗаказПокупателя.Договор.ВалютаРасчетов = КурсыВалютСрезПоследних.Валюта},
	|	Константа.НациональнаяВалюта КАК НациональнаяВалюта,
	|	Константа.ФункциональнаяОпцияРезервированиеЗапасов КАК РезервированиеЗапасов
	|ГДЕ
	|	ЗаказПокупателя.Ссылка В(&МассивЗаказов)";

	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	Запрос.УстановитьПараметр("ДатаДокумента", ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса()));

	СтруктураИтогов = Новый Структура;
	СтруктураИтогов.Вставить("НоменклатураДоставки");
	СтруктураИтогов.Вставить("СтоимостьДоставки", 0);
	СтруктураИтогов.Вставить("СтавкаНДСДоставки");
	СтруктураИтогов.Вставить("СуммаНДСДоставки", 0);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		ЗначенияПроверяемыхРеквизитов = Новый Структура;
		ЗначенияПроверяемыхРеквизитов.Вставить("СостояниеЗаказа", Выборка.СостояниеЗаказа);
		ЗначенияПроверяемыхРеквизитов.Вставить("Проведен", Выборка.ОснованиеПроведен);
		ЗначенияПроверяемыхРеквизитов.Вставить("ОжидаетсяВыборВариантаКП", Выборка.ОжидаетсяВыборВариантаКП);
		ЗначенияПроверяемыхРеквизитов.Вставить("ВидОперации", Выборка.ВидОперации);

		Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказаПокупателя(
		Выборка.ОснованиеСсылка, ЗначенияПроверяемыхРеквизитов);
		Если ЗначениеЗаполнено(Выборка.НоменклатураДоставки) Тогда
			ЗаполнитьЗначенияСвойств(СтруктураИтогов, Выборка, "НоменклатураДоставки, СтавкаНДСДоставки");
			СтруктураИтогов.СтоимостьДоставки = СтруктураИтогов.СтоимостьДоставки + Выборка.СтоимостьДоставки;
			СтруктураИтогов.СуммаНДСДоставки = СтруктураИтогов.СуммаНДСДоставки + Выборка.СуммаНДСДоставки;
		КонецЕсли;

	КонецЦикла;

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураИтогов);

	Если Не ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		ЗначениеНастройки = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнойСклад");
		Если Не ЗначениеЗаполнено(ЗначениеНастройки) Тогда
			СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
		КонецЕсли;
	КонецЕсли;

	// Заполнение табличной части.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ЗаказыОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыОстатки.Характеристика КАК Характеристика,
	|	ЗаказыОстатки.Склад КАК Склад,
	|	СУММА(ЗаказыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|		ЗаказыОстатки.Номенклатура КАК Номенклатура,
	|		ЗаказыОстатки.Характеристика КАК Характеристика,
	|		ЗаказыОстатки.Склад КАК Склад,
	|		ЗаказыОстатки.КоличествоОстаток КАК КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.ЗаказыПокупателей.Остатки(
	|				,
	|				ЗаказПокупателя В (&МассивЗаказов)
	|					И (Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|						ИЛИ Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|						ИЛИ Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат))) КАК ЗаказыОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаЗаказыПокупателей.ЗаказПокупателя,
	|		ДвиженияДокументаЗаказыПокупателей.Номенклатура,
	|		ДвиженияДокументаЗаказыПокупателей.Характеристика,
	|		ДвиженияДокументаЗаказыПокупателей.Склад,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаЗаказыПокупателей.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗаказыПокупателей.Количество, 0)
	|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗаказыПокупателей.Количество, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.ЗаказыПокупателей КАК ДвиженияДокументаЗаказыПокупателей
	|	ГДЕ
	|		ДвиженияДокументаЗаказыПокупателей.Регистратор = &Ссылка) КАК ЗаказыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыОстатки.ЗаказПокупателя,
	|	ЗаказыОстатки.Номенклатура,
	|	ЗаказыОстатки.Характеристика,
	|	ЗаказыОстатки.Склад
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЗаказыОстатки.КоличествоОстаток) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателяЗапасы.НомерСтроки КАК НомерСтроки,
	|	ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателяЗапасы.Номенклатура.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|				ИЛИ ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТипНоменклатурыЗапас,
	|	ЗаказПокупателяЗапасы.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ЗаказПокупателяЗапасы.ЕдиницаИзмерения.Коэффициент, 1)
	|	КОНЕЦ КАК Коэффициент,
	|	ЗаказПокупателяЗапасы.Количество КАК Количество,
	|	ЗаказПокупателяЗапасы.КоличествоСобрано КАК КоличествоСобрано,
	|	ЗаказПокупателяЗапасы.ЕстьСборка КАК ЕстьСборка,
	|	ЗаказПокупателяЗапасы.Партия КАК Партия,
	|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЗаказПокупателяЗапасы.Цена КАК Цена,
	|	ЗаказПокупателяЗапасы.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	ЗаказПокупателяЗапасы.СуммаСкидкиНаценки КАК СуммаСкидкиНаценки,
	|	ЗаказПокупателяЗапасы.Сумма КАК Сумма,
	|	ЗаказПокупателяЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ЗаказПокупателяЗапасы.СуммаНДС КАК СуммаНДС,
	|	ЗаказПокупателяЗапасы.Всего КАК Всего,
	|	ЗаказПокупателяЗапасы.Ссылка КАК Заказ,
	|	ЗаказПокупателяЗапасы.Ссылка.Проект КАК Проект,
	|	ЗаказПокупателяЗапасы.Содержание КАК Содержание,
	|	ЗаказПокупателяЗапасы.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	|	ЗаказПокупателяЗапасы.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|	ЗаказПокупателяЗапасы.СуммаСкидкиОплатыБонусом КАК СуммаСкидкиОплатыБонусом,
	|	ЗаказПокупателяЗапасы.ПродажаПодарка КАК ПродажаПодарка,
	|	ЗаказПокупателяЗапасы.КлючСвязи КАК КлючСвязи,
	|	ЗаказПокупателяЗапасы.Вес КАК Вес,
	|	ЗаказПокупателяЗапасы.Объем КАК Объем,
	|	ЗаказПокупателяЗапасы.Номенклатура.Вес КАК ВесЕдиницыТовара,
	|	ЗаказПокупателяЗапасы.Номенклатура.Объем КАК ОбъемЕдиницыТовара,
	|	ВЫБОР
	|		КОГДА &РезервированиеЗапасов
	|					И ЗаказПокупателяЗапасы.СтруктурнаяЕдиницаРезерв <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|				ИЛИ ЗаказПокупателяЗапасы.Ссылка.УчетПотребностиПоСкладам
	|			ТОГДА ЗаказПокупателяЗапасы.СтруктурнаяЕдиницаРезерв
	|		ИНАЧЕ ЗаказПокупателяЗапасы.Номенклатура.Склад
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ЗаказПокупателяЗапасы.Ссылка.УчетПотребностиПоСкладам КАК УчетПотребностиПоСкладам,
	|	ЗаказПокупателяЗапасы.Номенклатура.Ячейка КАК Ячейка,
	|	ЗаказПокупателяЗапасы.Номенклатура.Ячейка.Владелец КАК СтруктурнаяЕдиницаЯчейки,
	|	ЗаказПокупателяЗапасы.НоменклатураНабора КАК НоменклатураНабора,
	|	ЗаказПокупателяЗапасы.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	ЗаказПокупателяЗапасы.ДоляСтоимости КАК ДоляСтоимости,
	|	ЗаказПокупателяЗапасы.Номенклатура.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	ЗаказПокупателяЗапасы.Номенклатура.ПрослеживаемыйКомплект КАК ПрослеживаемыйКомплект
	|ИЗ
	|	ВТЗаказПокупателяЗапасы КАК ЗаказПокупателяЗапасы
	|ГДЕ
	|	(ЗаказПокупателяЗапасы.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|			ИЛИ ЗаказПокупателяЗапасы.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ИЛИ ЗаказПокупателяЗапасы.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат))
	|	И НЕ ЗаказПокупателяЗапасы.ПродажаПодарка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СкидкиНаценки.Ссылка КАК Заказ,
	|	СкидкиНаценки.КлючСвязи КАК КлючСвязи,
	|	СкидкиНаценки.СкидкаНаценка КАК СкидкаНаценка,
	|	СкидкиНаценки.Сумма КАК Сумма
	|ИЗ
	|	Документ.ЗаказПокупателя.СкидкиНаценки КАК СкидкиНаценки
	|ГДЕ
	|	СкидкиНаценки.Ссылка В(&МассивЗаказов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДобавленныеНаборы.Ссылка КАК Заказ,
	|	ДобавленныеНаборы.НоменклатураНабора КАК НоменклатураНабора,
	|	ДобавленныеНаборы.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	ДобавленныеНаборы.Количество КАК Количество
	|ПОМЕСТИТЬ ВТДобавленныеНаборы
	|ИЗ
	|	Документ.ЗаказПокупателя.ДобавленныеНаборы КАК ДобавленныеНаборы
	|ГДЕ
	|	ДобавленныеНаборы.Ссылка В(&МассивЗаказов)
	|	И ДобавленныеНаборы.НомерВариантаКП = ДобавленныеНаборы.Ссылка.ОсновнойВариантКП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДобавленныеНаборы.Заказ КАК Заказ,
	|	ДобавленныеНаборы.НоменклатураНабора КАК НоменклатураНабора,
	|	ДобавленныеНаборы.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	ДобавленныеНаборы.Количество КАК Количество
	|ИЗ
	|	ВТДобавленныеНаборы КАК ДобавленныеНаборы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателяПредоплата.Ссылка КАК Ссылка,
	|	ЗаказПокупателяПредоплата.НомерСтроки КАК НомерСтроки,
	|	ЗаказПокупателяПредоплата.Документ КАК Документ,
	|	ЗаказПокупателяПредоплата.НомерСертификата КАК НомерСертификата,
	|	ЗаказПокупателяПредоплата.СуммаРасчетов КАК СуммаРасчетов,
	|	ЗаказПокупателяПредоплата.Курс КАК Курс,
	|	ЗаказПокупателяПредоплата.Кратность КАК Кратность,
	|	ЗаказПокупателяПредоплата.СуммаПлатежа КАК СуммаПлатежа,
	|	ЗаказПокупателяПредоплата.ОплатаБонусами КАК ОплатаБонусами,
	|	ЗаказПокупателяПредоплата.ОплатаСертификатом КАК ОплатаСертификатом,
	|	ЗаказПокупателяПредоплата.Ссылка КАК Заказ
	|ИЗ
	|	Документ.ЗаказПокупателя.Предоплата КАК ЗаказПокупателяПредоплата
	|ГДЕ
	|	ЗаказПокупателяПредоплата.Ссылка В(&МассивЗаказов)
	|	И НЕ ЗаказПокупателяПредоплата.ОплатаБонусами
	|	И НЕ ЗаказПокупателяПредоплата.ОплатаСертификатом
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателяПредоплата.Ссылка КАК Ссылка,
	|	ЗаказПокупателяПредоплата.НомерСтроки КАК НомерСтроки,
	|	ЗаказПокупателяПредоплата.Документ КАК Документ,
	|	ЗаказПокупателяПредоплата.НомерСертификата КАК НомерСертификата,
	|	ЗаказПокупателяПредоплата.СуммаРасчетов КАК СуммаРасчетов,
	|	ЗаказПокупателяПредоплата.Курс КАК Курс,
	|	ЗаказПокупателяПредоплата.Кратность КАК Кратность,
	|	ЗаказПокупателяПредоплата.СуммаПлатежа КАК СуммаПлатежа,
	|	ЗаказПокупателяПредоплата.ОплатаБонусами КАК ОплатаБонусами,
	|	ЗаказПокупателяПредоплата.ОплатаСертификатом КАК ОплатаСертификатом,
	|	ЗаказПокупателяПредоплата.Ссылка КАК Заказ
	|ИЗ
	|	Документ.ЗаказПокупателя.Предоплата КАК ЗаказПокупателяПредоплата
	|ГДЕ
	|	ЗаказПокупателяПредоплата.Ссылка В(&МассивЗаказов)
	|	И ЗаказПокупателяПредоплата.ОплатаБонусами
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДобавленныеНаборы.Заказ КАК Заказ,
	|	ДобавленныеНаборы.НоменклатураНабора КАК НоменклатураНабора,
	|	ДобавленныеНаборы.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	ДобавленныеНаборы.Количество КАК Количество
	|ИЗ
	|	ВТДобавленныеНаборы КАК ДобавленныеНаборы
	|ГДЕ
	|	ДобавленныеНаборы.НоменклатураНабора.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПримененныеПромокоды.Промокод КАК Промокод,
	|	ПримененныеПромокоды.УсловиеПредоставленияСкидки КАК УсловиеПредоставленияСкидки,
	|	ПримененныеПромокоды.СкидкаПредоставлена КАК СкидкаПредоставлена,
	|	ПримененныеПромокоды.ЭтоАктивацияПромокода КАК ЭтоАктивацияПромокода
	|ИЗ
	|	Документ.ЗаказПокупателя.ПримененныеПромокоды КАК ПримененныеПромокоды
	|ГДЕ
	|	ПримененныеПромокоды.Ссылка В(&МассивЗаказов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыбранныеУправляемыеСкидки.СкидкаНаценка КАК СкидкаНаценка,
	|	ВыбранныеУправляемыеСкидки.КлючСвязи КАК КлючСвязи
	|ИЗ
	|	Документ.ЗаказПокупателя.ВыбранныеУправляемыеСкидки КАК ВыбранныеУправляемыеСкидки
	|ГДЕ
	|	ВыбранныеУправляемыеСкидки.Ссылка В(&МассивЗаказов)
	|		И ВыбранныеУправляемыеСкидки.НомерВариантаКП = ВыбранныеУправляемыеСкидки.Ссылка.ОсновнойВариантКП";

	Документы.ЗаказПокупателя.ДобавитьТаблицуЗапасыВМенеджерВременныхТаблиц(МассивЗаказов,
	Запрос.МенеджерВременныхТаблиц, Ложь);

	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("РезервированиеЗапасов", ПолучитьФункциональнуюОпцию("РезервированиеЗапасов"));

	МассивРезультатов = Запрос.ВыполнитьПакет();
	ТаблицаОстатков = МассивРезультатов[0].Выгрузить();
	ТаблицаОстатков.Индексы.Добавить("ЗаказПокупателя,Номенклатура,Характеристика");

	// АвтоматическиеСкидки.
	ИспользоватьАвтоматическиеСкидки = ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиНаценки");
	Если ИспользоватьАвтоматическиеСкидки Тогда
		СкидкиНаценки.Очистить();
	КонецЕсли;
	// Конец АвтоматическиеСкидки.

	// Доставка
	Если ЗначениеЗаполнено(НоменклатураДоставки) И ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		СтруктураДляПоиска = Новый Структура;
		СтруктураДляПоиска.Вставить("Номенклатура", НоменклатураДоставки);
		СтруктураДляПоиска.Вставить("Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		СтруктураДляПоиска.Вставить("ЗаказПокупателя", ДанныеЗаполнения);
		МассивСтрокОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоиска);
		Если МассивСтрокОстатков.Количество() = 0 Тогда
			НоменклатураДоставки = Неопределено;
			СтоимостьДоставки = 0;
			СуммаНДСДоставки = 0;
		КонецЕсли;
	КонецЕсли; 
	// Конец Доставка

	// Наборы
	ПропускаемыеНаборы = Новый Массив;
	ВыборкаИсключаемыеНаборы = МассивРезультатов[7].Выбрать();
	Пока ВыборкаИсключаемыеНаборы.Следующий() Цикл
		ДобавитьОписаниеНабора(
		ПропускаемыеНаборы,
		ВыборкаИсключаемыеНаборы.НоменклатураНабора,
		ВыборкаИсключаемыеНаборы.ХарактеристикаНабора,
		ВыборкаИсключаемыеНаборы.Заказ);
	КонецЦикла; 
	// Конец Наборы

	Запасы.Очистить();
	СерииНоменклатуры.Очистить();
	// Ключ связи нужно поменять, т.к. накладную можно вводить на основании сразу двух заказов.
	// В этом случае ключи связи могут дублироваться.
	ТекКлючСвязи = 0;

	Если ТаблицаОстатков.Количество() > 0 Тогда

		Выборка = МассивРезультатов[1].Выбрать();
		Пока Выборка.Следующий() Цикл

			СтруктураДляПоиска = Новый Структура;
			СтруктураДляПоиска.Вставить("ЗаказПокупателя", Выборка.Заказ);
			СтруктураДляПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
			СтруктураДляПоиска.Вставить("Характеристика", Выборка.Характеристика);
			Если Выборка.УчетПотребностиПоСкладам И ЗначениеЗаполнено(Выборка.СтруктурнаяЕдиница) Тогда
				СтруктураДляПоиска.Вставить("Склад", Выборка.СтруктурнаяЕдиница);
			КонецЕсли;

			МассивСтрокОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоиска);
			Если МассивСтрокОстатков.Количество() = 0 И Выборка.УчетПотребностиПоСкладам Тогда
				// Попытка поиска остатка по другому складу
				СтруктураДляПоиска.Удалить("Склад");
				МассивСтрокОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоиска);
			КонецЕсли;
			Если МассивСтрокОстатков.Количество() = 0 Тогда
				// Наборы
				Если ЗначениеЗаполнено(Выборка.НоменклатураНабора) Тогда
					ДобавитьОписаниеНабора(
					ПропускаемыеНаборы, Выборка.НоменклатураНабора, Выборка.ХарактеристикаНабора, Выборка.Заказ);
				КонецЕсли;
				// Конец Наборы
				Продолжить;
			КонецЕсли;

			ОстатокКОтгрузке = Выборка.Количество;
			ОстатокСобрано = Выборка.КоличествоСобрано;

			Для Каждого СтрокаОстаток Из МассивСтрокОстатков Цикл

				Если СтрокаОстаток.КоличествоОстаток = 0 Тогда
					Продолжить;
				КонецЕсли;

				Если ПолучитьФункциональнуюОпцию("ИспользоватьСборкуЗаказов") И Выборка.ЕстьСборка Тогда
					Если Выборка.СтруктурнаяЕдиница = СтрокаОстаток.Склад Тогда
						УжеОтгружено = ОстатокКОтгрузке - СтрокаОстаток.КоличествоОстаток;
					Иначе
						УжеОтгружено = 0;
					КонецЕсли;
					СобраноНеОтгружено = ОстатокСобрано - ?(УжеОтгружено > 0, УжеОтгружено, 0);
					Если СобраноНеОтгружено > 0 Тогда
						ВыборкаКоличество = СобраноНеОтгружено;
					Иначе
						ВыборкаКоличество = 0;
						// Наборы
						Если ЗначениеЗаполнено(Выборка.НоменклатураНабора) Тогда
							ДобавитьОписаниеНабора(
							ПропускаемыеНаборы, Выборка.НоменклатураНабора, Выборка.ХарактеристикаНабора, Выборка.Заказ);
						КонецЕсли;
						// Конец Наборы
						Продолжить;
					КонецЕсли;
				Иначе
					ВыборкаКоличество = ОстатокКОтгрузке;
				КонецЕсли;

				НоваяСтрока = Запасы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				Если Выборка.УчетПотребностиПоСкладам Тогда
					НоваяСтрока.СтруктурнаяЕдиница = СтрокаОстаток.Склад;
				КонецЕсли;

				Если ПоложениеПроекта <> Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти Тогда
					НоваяСтрока.Проект = Проект;
				КонецЕсли;

				// Ключ связи нужно поменять, т.к. накладную можно вводить на основании сразу двух заказов.
				// В этом случае ключи связи могут дублироваться.
				ТекКлючСвязи = ТекКлючСвязи + 1;
				НоваяСтрока.КлючСвязи = ТекКлючСвязи;

				КоличествоКСписанию = Окр(ВыборкаКоличество * Выборка.Коэффициент, 3);
				СтрокаОстаток.КоличествоОстаток = СтрокаОстаток.КоличествоОстаток - КоличествоКСписанию;

				Если СтрокаОстаток.КоличествоОстаток < 0 Или ВыборкаКоличество <> ОстатокКОтгрузке Тогда

					// Наборы
					Если ЗначениеЗаполнено(Выборка.НоменклатураНабора) Тогда
						ДобавитьОписаниеНабора(
						ПропускаемыеНаборы, Выборка.НоменклатураНабора, Выборка.ХарактеристикаНабора, Выборка.Заказ);
					КонецЕсли;
					// Конец Наборы

					Если СтрокаОстаток.КоличествоОстаток < 0 Тогда
						КоличествоКСписанию = Окр((КоличествоКСписанию + СтрокаОстаток.КоличествоОстаток)
						/ Выборка.Коэффициент, 3);
						СтрокаОстаток.КоличествоОстаток = 0;
					Иначе
						КоличествоКСписанию = Окр(КоличествоКСписанию / Выборка.Коэффициент, 3);
					КонецЕсли;

					ДанныеСтроки = Новый Структура;
					ДанныеСтроки.Вставить("Количество", КоличествоКСписанию);
					ДанныеСтроки.Вставить("Цена", Выборка.Цена);
					ДанныеСтроки.Вставить("Сумма", 0);
					ДанныеСтроки.Вставить("ПроцентСкидкиНаценки", Выборка.ПроцентСкидкиНаценки);
					ДанныеСтроки.Вставить("СуммаСкидкиНаценки", 0);
					ДанныеСтроки.Вставить("СтавкаНДС", Выборка.СтавкаНДС);
					ДанныеСтроки.Вставить("СуммаНДС", 0);
					ДанныеСтроки.Вставить("СуммаВключаетНДС", СуммаВключаетНДС);
					ДанныеСтроки.Вставить("Всего", 0);
					ДанныеСтроки.Вставить("Вес", Выборка.ВесЕдиницыТовара * КоличествоКСписанию);
					ДанныеСтроки.Вставить("Объем", Выборка.ОбъемЕдиницыТовара * КоличествоКСписанию);

					ЗаполнениеОбъектовУНФ.РассчитатьСуммыВСтрокеТабличнойЧасти(ДанныеСтроки);

					ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСтроки);

				КонецЕсли;

				Если Не ЗначениеЗаполнено(НоваяСтрока.СтруктурнаяЕдиница) Тогда
					ЗначениеПоУмолчанию = Справочники.СтруктурныеЕдиницы.ОсновнойСклад();
					НоваяСтрока.СтруктурнаяЕдиница = ?(ЗначениеЗаполнено(СтруктурнаяЕдиница), СтруктурнаяЕдиница,
					ЗначениеПоУмолчанию);
				КонецЕсли;

				Если Выборка.СтруктурнаяЕдиницаЯчейки <> НоваяСтрока.СтруктурнаяЕдиница Тогда
					НоваяСтрока.Ячейка = Неопределено;
				КонецЕсли;

				ОстатокКОтгрузке = ОстатокКОтгрузке - КоличествоКСписанию;
				ОстатокСобрано = ОстатокСобрано - КоличествоКСписанию;
				Если ОстатокКОтгрузке <= 0 Тогда
					Прервать;
				КонецЕсли;

			КонецЦикла;

		КонецЦикла;

	КонецЕсли;

	// Наборы
	// Удаление неполных и неподходящих наборов
	Для Каждого ОписаниеНабора Из ПропускаемыеНаборы Цикл
		УдаляемыеСтроки = Запасы.НайтиСтроки(ОписаниеНабора);
		Для Каждого СтрокаЗапаса Из УдаляемыеСтроки Цикл
			Для Каждого СтрокаСкидки Из СкидкиНаценки.НайтиСтроки(Новый Структура("КлючСвязи", СтрокаЗапаса.КлючСвязи)) Цикл
				СкидкиНаценки.Удалить(СтрокаСкидки);
			КонецЦикла;
			Запасы.Удалить(СтрокаЗапаса);
		КонецЦикла;
	КонецЦикла;

	ДобавленныеНаборы.Очистить();
	ВыборкаНаборы = МассивРезультатов[4].Выбрать();
	Пока ВыборкаНаборы.Следующий() Цикл
		Если ПропуститьНабор(ПропускаемыеНаборы, ВыборкаНаборы) Тогда
			Продолжить;
		КонецЕсли;
		ДобавитьНаборы(ВыборкаНаборы);
	КонецЦикла; 
	// Конец Наборы

	// Взаиморасчеты
	Предоплата.Очистить();
	Предоплата.Загрузить(МассивРезультатов[5].Выгрузить());

	// АвтоматическиеСкидки.
	Если ИспользоватьАвтоматическиеСкидки Тогда
		// Управляемые скидки
		ТаблицаВыбранныеУправляемыеСкидки = МассивРезультатов[9].Выгрузить();
		КлючиСвязиДокумента = Запасы.ВыгрузитьКолонку("КлючСвязи");
		КлючиСвязиДокумента.Добавить(0); // Скидки, действующие на документ целиком
		СтрокиПеренести = Новый Массив;
		Для Каждого СтрокаУправляемойСкидки Из ТаблицаВыбранныеУправляемыеСкидки Цикл
			Если Не КлючиСвязиДокумента.Найти(СтрокаУправляемойСкидки.КлючСвязи) = Неопределено Тогда
				СтрокиПеренести.Добавить(СтрокаУправляемойСкидки);
			КонецЕсли;
		КонецЦикла;
		ВыбранныеУправляемыеСкидки.Загрузить(ТаблицаВыбранныеУправляемыеСкидки.Скопировать(СтрокиПеренести));

		// Промокоды
		ТаблицаПримененныеПромокоды = МассивРезультатов[8].Выгрузить();
		// Если в заказе выдается промокод, но заказ еще не отгружен полностью,
		// Скидка с выдачей промокода не применится (она применяется только для последней отгрузки по заказу)
		// В таком случае, промокод при расчете скидок будет удален из ТЧ.
		ПримененныеПромокоды.Загрузить(ТаблицаПримененныеПромокоды);
		РасчетныеСкидки = СкидкиНаценкиСерверПереопределяемый.ПолучитьСкидкиНаценкиПоЗаказу(ЭтотОбъект);
		СуммаОплатыБонусами = 0;
		Если РасчетныеСкидки.Свойство("СуммаОплатыБонусами", СуммаОплатыБонусами) Тогда
			ПараметрыБП = РаботаСБонусами.РеквизитыБонуснойПрограммы(ДисконтнаяКарта);
			Если Не ПараметрыБП.Свойство("БонуснаяПрограмма") Или Не ЗначениеЗаполнено(ПараметрыБП.БонуснаяПрограмма) Тогда
				СуммаОплатыБонусами = 0;
			КонецЕсли;
			// Оплата в рублях, а сколько списывается бонусов с карты - нужно считать по курсу
			КурсБонусов = 1;
			Если ПараметрыБП.Свойство("КурсБонусов") И ЗначениеЗаполнено(ПараметрыБП.КурсБонусов) Тогда
				КурсБонусов = ПараметрыБП.КурсБонусов;
			КонецЕсли;

			ВыборкаОплатаБонусами = МассивРезультатов[6].Выбрать();
			Пока ВыборкаОплатаБонусами.Следующий() Цикл
				Если СуммаОплатыБонусами <= 0 Тогда
					Прервать;
				КонецЕсли;
				ОплатаБонусамиСтроки = Мин(СуммаОплатыБонусами, ВыборкаОплатаБонусами.СуммаРасчетов);
				Если ОплатаБонусамиСтроки <= 0 Тогда
					Продолжить;
				КонецЕсли;
				СтрокаОплатыБонусами = Предоплата.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаОплатыБонусами, ВыборкаОплатаБонусами);
				// Курс - это сколько рублей зачтется за 1 потраченный бонус
				СтрокаОплатыБонусами.СуммаРасчетов = ОплатаБонусамиСтроки / КурсБонусов;
				СуммаОплатыБонусами = СуммаОплатыБонусами - ОплатаБонусамиСтроки;
			КонецЦикла;
			// Оплаты, которые уже включены в ТЧ, убираем из результатов расчета
			РасчетныеСкидки.СуммаОплатыБонусами = СуммаОплатыБонусами;
		КонецЕсли;
		РезультатПрименения = СкидкиНаценкиСервер.ПрименитьРассчитанныеСкидкиКОбъекту(ЭтотОбъект, РасчетныеСкидки);
		ВыданныеПодарки = Новый Массив;
		ВидСтавкиОрганизации = Неопределено;
		Если РезультатПрименения.Свойство("ДобавленныеСтрокиЗапасов", ВыданныеПодарки) Тогда
			Для Каждого ОписаниеПодарка Из ВыданныеПодарки Цикл
				СтрокаЗапаса = ОписаниеПодарка.Ключ;

				РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаЗапаса.Номенклатура,
				"ВидСтавкиНДС, Вес, Объем");
				СтрокаЗапаса.Вес = СтрокаЗапаса.Количество * РеквизитыНоменклатуры.Вес;
				СтрокаЗапаса.Объем = СтрокаЗапаса.Количество * РеквизитыНоменклатуры.Объем;
				ВидСтавкиНоменклатуры = РеквизитыНоменклатуры.ВидСтавкиНДС;
				Если НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.НаЭкспорт") Тогда
					СтрокаЗапаса.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
				ИначеЕсли НалогообложениеНДС = ПредопределенноеЗначение(
					"Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС") Тогда
					СтрокаЗапаса.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
				ИначеЕсли ЗначениеЗаполнено(ВидСтавкиНоменклатуры) Тогда
					СтрокаЗапаса.СтавкаНДС = Справочники.СтавкиНДС.СтавкаНДС(ВидСтавкиНоменклатуры);
				Иначе
					Если ВидСтавкиОрганизации = Неопределено Тогда
						ВидСтавкиОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация,
						"ВидСтавкиНДСПоУмолчанию");
					КонецЕсли;
					СтрокаЗапаса.СтавкаНДС = Справочники.СтавкиНДС.СтавкаНДС(ВидСтавкиОрганизации);
				КонецЕсли;
				ПараметрыРасчета = Новый Структура("СуммаВключаетНДС", СуммаВключаетНДС);
				ТабличныеЧастиУНФКлиентСервер.РассчитатьСуммуНДСИВсего(СтрокаЗапаса, ПараметрыРасчета);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	// Конец АвтоматическиеСкидки.

	Вес = Запасы.Итог("Вес");
	Объем = Запасы.Итог("Объем");

	ПоложениеСкладаИзНастроек = ПерсональныеНастройкиРУНФ.Прочитать("ПоложениеСкладаВДокументахОтгрузки");
	Если Не ЗначениеЗаполнено(ПоложениеСкладаИзНастроек) Тогда
		ПоложениеСкладаИзНастроек = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
	КонецЕсли;

	ЕстьСкладВЗаказеПокупателя = ПолучитьФункциональнуюОпцию("РазрешитьСкладыВТабличныхЧастях")
	И (ПолучитьФункциональнуюОпцию("РезервированиеЗапасов") Или ПолучитьФункциональнуюОпцию(
	"УчетПотребностиПоСкладам"));

	Если Не ЕстьСкладВЗаказеПокупателя Тогда
		ПоложениеСклада = ПоложениеСкладаИзНастроек;
	КонецЕсли
	;

	Ячейка = ЗаполнениеОбъектовУНФ.ЗначениеДляШапки(Запасы, "Ячейка");
	Если ПоложениеСклада <> Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти И ЕстьСкладВЗаказеПокупателя Тогда
		Для Каждого СтрокаТабличнойЧасти Из Запасы Цикл
			Если СтрокаТабличнойЧасти.СтруктурнаяЕдиница <> СтруктурнаяЕдиница Или СтрокаТабличнойЧасти.Ячейка
				<> Ячейка Тогда
				ПоложениеСклада = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	// Заполнение резервов.
	Если Запасы.Количество() > 0 И Константы.ФункциональнаяОпцияРезервированиеЗапасов.Получить() И ЗначениеЗаполнено(
		СтруктурнаяЕдиница) Тогда
		ЗаполнитьКолонкуРезервПоРезервам();
	КонецЕсли;

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		//@skip-check reading-attribute-from-database
		ПеренестиСерииНоменклатуры(ДанныеЗаполнения.СерииНоменклатуры, ДанныеЗаполнения.Запасы,
		ДанныеЗаполнения.ОсновнойВариантКП);
	КонецЕсли;

	ДоговорВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВидДоговора");
	Если ЗначениеЗаполнено(Договор) И ДоговорВидДоговора = Перечисления.ВидыДоговоров.СКомиссионером Тогда
		ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию;

		НоменклатураДоставки = Неопределено;
		СтоимостьДоставки = 0;
		СуммаНДСДоставки = 0;

		ПартииНоменклатуры = Запасы.ВыгрузитьКолонку("Партия");
		ЗначениеРеквизитаПартий = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ПартииНоменклатуры, "Статус");

		Для Каждого СтрокаЗапасы Из Запасы Цикл
			Если Не ЗначениеРеквизитаПартий[СтрокаЗапасы.Партия] = Неопределено
				И Не ЗначениеРеквизитаПартий[СтрокаЗапасы.Партия].Статус = Перечисления.СтатусыПартий.СобственныеЗапасы Тогда
				СтрокаЗапасы.Партия = Неопределено;
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;

	// Учет по УСН
	СистемаНалогообложенияСтруктура = РегистрыСведений.СистемыНалогообложенияОрганизаций.ОпределитьСистемуНалогообложенияОрганизации(
	Организация, ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса()));
	Если СистемаНалогообложенияСтруктура.ПлательщикУСН Тогда
		Если СистемаНалогообложенияСтруктура.ПлательщикЕНВД Тогда
			ОрганизацияВидУчетаСтраховыхВзносов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация,
			"ВидУчетаСтраховыхВзносов");
			УчитыватьВНУ = Не (ОрганизацияВидУчетаСтраховыхВзносов
			= Перечисления.ВидыУчетаСтраховыхВзносов.УчитыватьВЕНВД);
		Иначе
			УчитыватьВНУ = Истина;
		КонецЕсли;
	Иначе
		УчитыватьВНУ = Ложь;
	КонецЕсли;

	Если ПолучитьФункциональнуюОпцию("ПроизводствоПодакцизныхТоваров") Тогда

		ВидыПроизведенныхПодакцизныхТоваров = Новый СписокЗначений;
		ВидыПроизведенныхПодакцизныхТоваров.ЗагрузитьЗначения(УчетАкцизовУНФ.СписокПроизводимыхПодакцизныхТоваров(
		Организация));
		ЕстьУчетПодакцизныхТоваров = ВидыПроизведенныхПодакцизныхТоваров.Количество() > 0;

		Если ЕстьУчетПодакцизныхТоваров Тогда

			ЭкспортПриРеализации = Справочники.Контрагенты.ЭтоИностраннаяОрганизация(Контрагент);
			ЭтоПередачаТоваров = ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию
			Или ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку Или ВидОперации
			= Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветХранение;

			ДатаПолученияАкциза = ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса());
			Для Каждого СтрокаТабличнойЧасти Из Запасы Цикл

				УчетАкцизовУНФ.ЗаполнитьСтрокуДаннымиАкцизов(СтрокаТабличнойЧасти, ВидыПроизведенныхПодакцизныхТоваров,
				ЭкспортПриРеализации, ЭтоПередачаТоваров, ДатаПолученияАкциза);
				Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения")
					Или Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаИзмерения) Тогда
					Коэффициент = 1;
				Иначе
					Коэффициент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТабличнойЧасти.ЕдиницаИзмерения,
					"Коэффициент", Истина);
				КонецЕсли;

				СтрокаТабличнойЧасти.СуммаАкциза = СтрокаТабличнойЧасти.СуммаАкциза * Коэффициент;
				СтрокаТабличнойЧасти.СтавкаАкциза = СтрокаТабличнойЧасти.СтавкаАкциза * Коэффициент;

			КонецЦикла;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
