&НаКлиенте
Перем СписокВыбранныхДат; 

&НаКлиенте
Перем БлокировкаИзменения;  

&НаКлиенте
Перем КалендарьИзменен; 

&НаКлиенте
Перем ТекущийПользователь;

&НаКлиенте
Перем ПривелегированныйПользователь;    

&НаКлиенте
Перем ПредыдущийСотрудник;

&НаКлиенте
Процедура КалендарьПриИзменении(Элемент)
	
	Если БлокировкаИзменения = Истина Тогда
		Возврат;
	КонецЕсли;

	Если СписокВыбранныхДат = Неопределено Тогда
		СписокВыбранныхДат = Новый СписокЗначений;
	КонецЕсли;

	БлокировкаИзменения = Истина;

	ВыбраннаяДата = Календарь;
	
	Если Не ПривелегированныйПользователь Тогда
		Если ВыбраннаяДата < ТекущаяДата() Тогда
			Сообщение = "Изменение даты отпуска задним числом не возможно. Текущая дата: " + Формат(ТекущаяДата(), "ДЛФ=Д");
			Сообщить(Сообщение);
			ОбновитьВыделениеКалендаря(); 
			ОбновитьКоличествоВыбранныхДат();
			БлокировкаИзменения = Ложь;
			Возврат;	
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(ВыбраннаяДата) Тогда

		ЭлементСписка = СписокВыбранныхДат.НайтиПоЗначению(ВыбраннаяДата);

		Если ЭлементСписка = Неопределено Тогда
			СписокВыбранныхДат.Добавить(ВыбраннаяДата);
		Иначе
			СписокВыбранныхДат.Удалить(ЭлементСписка);
		КонецЕсли;

	КонецЕсли;

	ОбновитьВыделениеКалендаря(); 
	ОбновитьКоличествоВыбранныхДат();
	КалендарьИзменен = Истина;
    		
	БлокировкаИзменения = Ложь;

КонецПроцедуры

&НаСервере
Функция ПолучитьТекущегоПользователя()
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Элементы.Календарь.НачалоПериодаОтображения = НачалоГода(ТекущаяДата());
	Элементы.Календарь.КонецПериодаОтображения = КонецГода(ТекущаяДата());
	ТекущийПользователь = ПолучитьТекущегоПользователя();
	ПривелегированныйПользователь = ВходитВМенеджерыПоПерсоналу(ТекущийПользователь);
                                                            

	Объект.Сотрудник = ПолучитьСотрудникаТекущегоПользователя();
	ПредыдущийСотрудник = ПолучитьСотрудникаТекущегоПользователя();
	Объект.ВыбранныйГод = Год(ТекущаяДата());

	СписокВыбранныхДат =
    ПолучитьДатыОтпускаСотрудника(
        Объект.Сотрудник,
        Объект.ВыбранныйГод);
	ОбновитьПериодКалендаря();
	ОбновитьВыделениеКалендаря();
	ОбновитьКоличествоВыбранныхДат();
	КалендарьИзменен = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВыделениеКалендаря()

	Если СписокВыбранныхДат = Неопределено Тогда
		СписокВыбранныхДат = Новый СписокЗначений;
	КонецЕсли;

	Элементы.Календарь.ВыделенныеДаты.Очистить();

	МассивДат = СписокВыбранныхДат.ВыгрузитьЗначения();

	Для Каждого ТекущаяДата Из МассивДат Цикл
		Элементы.Календарь.ВыделенныеДаты.Добавить(ТекущаяДата);
	КонецЦикла;

	

КонецПроцедуры
 
&НаКлиенте
Процедура Сохранить(Команда)
	
	СохранитьДатыОтпуска(
        ПредыдущийСотрудник,
        СписокВыбранныхДат,
        Объект.ВыбранныйГод);
		Сообщение = "График отпусков сохранен. Использованных дней отпуска: " + КоличествоВыбранныхДат;
		Сообщить(Сообщение);
		КалендарьИзменен = Ложь;
	
КонецПроцедуры
			
&НаКлиенте
Процедура ГодВперед(Команда)
	
	ДействияПриИзмененииКалендаря("ГодВперед");
	
КонецПроцедуры

&НаКлиенте
Процедура ГодВпередПродолжить()

	Объект.ВыбранныйГод = Объект.ВыбранныйГод + 1;
	
	Если Объект.ВыбранныйГод <> Год(ТекущаяДата()) Тогда
		Элементы.ВыбранныйГод.ЦветТекста = Новый Цвет(255,0,0);
	Иначе
		Элементы.ВыбранныйГод.ЦветТекста = Новый Цвет(0,0,0);
	КонецЕсли; 
	ОбновитьПериодКалендаря();
	ПроверитьИзмененияИОбновить();

КонецПроцедуры

&НаКлиенте
Процедура ГодНазад(Команда)
	
	ДействияПриИзмененииКалендаря("ГодНазад");
	
КонецПроцедуры 

&НаКлиенте
Процедура ГодНазадПродолжить()

    Объект.ВыбранныйГод = Объект.ВыбранныйГод - 1;
	Если Объект.ВыбранныйГод <> Год(ТекущаяДата()) Тогда
		Элементы.ВыбранныйГод.ЦветТекста = Новый Цвет(255,0,0);
	Иначе
		Элементы.ВыбранныйГод.ЦветТекста = Новый Цвет(0,0,0);
	КонецЕсли;
	ОбновитьПериодКалендаря();
	ПроверитьИзмененияИОбновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИзмененияИОбновить()

    СписокВыбранныхДат =
        ПолучитьДатыОтпускаСотрудника(
            Объект.Сотрудник,
            Объект.ВыбранныйГод);
			
	ОбновитьПериодКалендаря();
    ОбновитьВыделениеКалендаря();
	ОбновитьКоличествоВыбранныхДат();

КонецПроцедуры
	
&НаСервере
Функция ПолучитьДатыОтпускаСотрудника(Сотрудник, ВыбранныйГод)

    Результат = Новый СписокЗначений;

    Если Не ЗначениеЗаполнено(Сотрудник) Тогда
        Возврат Результат;
    КонецЕсли;

    Запрос = Новый Запрос;

    Запрос.Текст =
    "ВЫБРАТЬ
    |   ДатыОтпусков.ДатаОтпуска КАК ДатаОтпуска
    |ИЗ
    |   РегистрСведений.csys1_ДатыОтпусков КАК ДатыОтпусков
    |ГДЕ
    |   ДатыОтпусков.Сотрудник = &Сотрудник
    |   И ДатыОтпусков.ДатаОтпуска МЕЖДУ &НачалоГода И &КонецГода
    |
    |УПОРЯДОЧИТЬ ПО
    |   ДатаОтпуска";

    Запрос.УстановитьПараметр(
        "Сотрудник",
        Сотрудник);

    Запрос.УстановитьПараметр(
        "НачалоГода",
        Дата(ВыбранныйГод,1,1));

    Запрос.УстановитьПараметр(
        "КонецГода",
        КонецДня(Дата(ВыбранныйГод,12,31)));

    Выборка = Запрос.Выполнить().Выбрать();

    Пока Выборка.Следующий() Цикл
        
        Результат.Добавить(
            НачалоДня(Выборка.ДатаОтпуска));

    КонецЦикла;

    Возврат Результат;

КонецФункции

&НаСервере
Функция ПолучитьСотрудникаТекущегоПользователя()
	ТекущийПользователь = ПолучитьТекущегоПользователя();
	
	Если Не ЗначениеЗаполнено(ТекущийПользователь) Тогда    
		Сообщить("Не удалось определить текущего пользователя.");
		Возврат Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	| Сотрудники.Ссылка КАК СотрудникСсылка,
	| Сотрудники.Наименование КАК Наименование,
	| Сотрудники.Физлицо КАК Физлицо
	| ИЗ
	| Справочник.Сотрудники КАК Сотрудники
	| ГДЕ
	| Наименование = &ИмяПользователя";
	
	Запрос.УстановитьПараметр("ИмяПользователя", ТекущийПользователь.Наименование);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.СотрудникСсылка;
	КонецЕсли;

	Сообщить("Для текущего пользователя не найден сотрудник.");
	Возврат Справочники.Сотрудники.ПустаяСсылка();

КонецФункции

&НаСервере
Процедура СохранитьДатыОтпуска(Сотрудник, СписокДат, ВыбранныйГод)

    Если Не ЗначениеЗаполнено(Сотрудник) Тогда
        Возврат;
    КонецЕсли;


    Набор = РегистрыСведений.csys1_ДатыОтпусков.СоздатьНаборЗаписей();
    Набор.Отбор.Сотрудник.Установить(Сотрудник);
    Набор.Прочитать();


    Индекс = Набор.Количество() - 1;

    Пока Индекс >= 0 Цикл

        Если Год(Набор[Индекс].ДатаОтпуска) = ВыбранныйГод Тогда
            Набор.Удалить(Индекс);
        КонецЕсли;
        Индекс = Индекс - 1;
    КонецЦикла;


    Для Каждого Элемент Из СписокДат Цикл
        Запись = Набор.Добавить();
        Запись.Сотрудник = Сотрудник;
        Запись.ДатаОтпуска = НачалоДня(Элемент.Значение);
    КонецЦикла;
    Набор.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоличествоВыбранныхДат()
     Если СписокВыбранныхДат = Неопределено Тогда
        КоличествоВыбранныхДат = 0;
        Возврат;
    КонецЕсли;

    КоличествоВыбранныхДат = 
        СписокВыбранныхДат.Количество();
	КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	ДействияПриИзмененииКалендаря(
		"СменаСотрудника",
		ПредыдущийСотрудник    
	);                      
	
	ПредыдущийСотрудник = Объект.Сотрудник;
	
КонецПроцедуры    
	
&НаКлиенте
Процедура СменаСотрудникаПродолжить()

	ТекущийСотрудник = ПолучитьСотрудникаТекущегоПользователя();  
		
	Если ПривелегированныйПользователь Тогда
		
		Элементы.Календарь.ТолькоПросмотр = Ложь;
		
	ИначеЕсли Объект.Сотрудник <> ТекущийСотрудник Тогда
		
		Сообщить("Сотрудник и пользователь не совпадают. Изменение календаря невозможно.");
		Элементы.Календарь.ТолькоПросмотр = Истина;
		
	Иначе
		
		Элементы.Календарь.ТолькоПросмотр = Ложь;
		
	КонецЕсли;

	СписокВыбранныхДат =
		ПолучитьДатыОтпускаСотрудника(
			Объект.Сотрудник,
			Объект.ВыбранныйГод);

	ОбновитьВыделениеКалендаря();
	ОбновитьКоличествоВыбранныхДат();

	КалендарьИзменен = Ложь;
КонецПроцедуры
	
&НаКлиенте
Процедура ОбновитьПериодКалендаря()

    Элементы.Календарь.НачалоПериодаОтображения =
        Дата(Объект.ВыбранныйГод,1,1);

    Элементы.Календарь.КонецПериодаОтображения =
        КонецГода(
            Дата(Объект.ВыбранныйГод,1,1));

		КонецПроцедуры
		
&НаСервере
Функция ВходитВМенеджерыПоПерсоналу(Пользователь)
	Группа = Справочники.ГруппыДоступа.НайтиПоНаименованию("Менеджер по персоналу");
	
	Если Группа.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Группа.Пользователи.Найти(Пользователь) <> Неопределено;
	
КонецФункции    

&НаКлиенте
Процедура ДействияПриИзмененииКалендаря(Действие, Параметр = Неопределено)

	Если КалендарьИзменен Тогда
		
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить("Сохранить");
		СписокКнопок.Добавить("Продолжить без сохранения");
		СписокКнопок.Добавить("Отмена");

		Оповещение = Новый ОписаниеОповещения(
			"ОбработкаОтветаНаВопрос",
			ЭтотОбъект,
			Новый Структура("Действие,Параметр", Действие, Параметр)
		);

		ПоказатьВопрос(
			Оповещение,
			"Есть изменения календаря. Все несохраненные изменения будут утеряны.",
			СписокКнопок
		);

	Иначе
		
		ОбработкаОтветаНаВопрос(
			"Продолжить без сохранения",
			Новый Структура("Действие,Параметр", Действие, Параметр)
		);

	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаОтветаНаВопрос(Результат, Параметры) Экспорт

	Если Результат = "Сохранить" Тогда
		
		Сохранить(Неопределено);

	ИначеЕсли Результат = "Продолжить без сохранения" Тогда
		
		КалендарьИзменен = Ложь;

	Иначе //Отмена
				
		Объект.Сотрудник = ПредыдущийСотрудник;
		Возврат;

	КонецЕсли;


	Если Параметры.Действие = "ГодВперед" Тогда
		
		ГодВпередПродолжить();

	ИначеЕсли Параметры.Действие = "ГодНазад" Тогда
		
		ГодНазадПродолжить();
		
	ИначеЕсли Параметры.Действие = "СменаСотрудника" Тогда
		
		СменаСотрудникаПродолжить();    
		
	ИначеЕсли Параметры.Действие = "Закрыть" Тогда
		
		КомандаЗакрытьПродолжение();

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СотрудникНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ПредыдущийСотрудник = Объект.Сотрудник;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрыть(Команда)
	ДействияПриИзмененииКалендаря("Закрыть");
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрытьПродолжение()
	Закрыть();
КонецПроцедуры



		

	